import project1Logo from '@/assets/img/logo-myaso.svg'
import project2Logo from '@/assets/img/logo-regul.svg'
import project3Logo from '@/assets/img/logo-parradosso.svg'
import project4Logo from '@/assets/img/logo-tchaika.svg'

const projectCards = [
  {
    slug: 'myasnitskiy',
    img: '/clients/myaso_main.jpg',
    logo: project1Logo,
    projectName: 'Мясницкий',
    projectType: 'Бутик-отель',
    stars: 4,
    title: 'Представляем вам Мясницкий Бутик-отель',
    subTitle: 'Новый мини-отель на самой аристократической улице столицы',
    text: [
      'В самом сердце нашей прекрасной столицы на одной из главных дорог ведущих к Кремлю расположился новый Бутик Отель «Myasnitsky». Улица Мясницкая стала известна в XVIII веке, на ней селились дворяне и новая аристократия и ездили цари...',
      'Здание отеля — памятник архитектуры, расположено в тихом уютном, сохранившем непередаваемую атмосферу старой Москвы, районе. Благодаря удобному расположению отеля, Вы будете находится в шаговой близости от делового и культурно-исторического сердца России, и одновременно в обстановке покоя и исключительности.',
      // 'Бутик Отель «Myasnitsky» — это уникальное сочетание эксклюзивных интерьеров и современного экологического дизайна, идеальное расположение в центре столицы.',
      // 'Отель «Myasnitsky» соответствует всем современным тенденциям и это прослеживается в стиле и дизайне отеля. Отелю присвоены четыре звезды.',
    ],
    // images: [
    //   {
    //     src: '/projects/myaso-1.jpg',
    //     alt: 'Номер отеля',
    //   },
    //   {
    //     src: '/projects/myaso-2.jpg',
    //     alt: 'Номер отеля',
    //   },
    //   {
    //     src: '/projects/myaso-3.jpg',
    //     alt: 'Номер отеля',
    //   },
    //   {
    //     src: '/projects/myaso-4.jpg',
    //     alt: 'Номер отеля',
    //   },
    //   {
    //     src: '/projects/myaso-5.jpg',
    //     alt: 'Номер отеля',
    //   },
    //   {
    //     src: '/projects/myaso-6.jpg',
    //     alt: 'Номер отеля',
    //   },
    //   {
    //     src: '/projects/myaso-7.jpg',
    //     alt: 'Номер отеля',
    //   },
    // ],
  },
  {
    slug: 'regul',
    img: '/clients/regul_main.jpg',
    logo: project2Logo,
    projectName: 'Regul',
    projectType: 'Бутик-отель',
    stars: 5,
    title: 'Представляем вам REGUL Boutique-Hotel',
    subTitle: 'Пятизвездочный бутик-отель в самом центре стоилцы',
    text: [
      'Бутик-отель «Regul» расположен в тихом переулке в самом центре Москвы, всего в 15 минутах ходьбы от Красной площади и Кремля и 5 минутах от трех станций метро: Тверской, Пушкинской, Чеховской.',
      'Все туристические места и достопримечательности вы сможете увидеть, прогуливаясь по Тверской, Петровке, Большой Дмитровке, Камергерскому, Никольской.',
      // 'В отеле расположен приятный и уютный ресторан , который может быть как местом для проведения деловых или неформальных встреч, так и местом для романтического свидания.',
      // 'Индивидуальный подход к оформлению каждого номера и сделали их эксклюзивными и максимально комфортными для Вас.',
    ],
    // images: [
    //   {
    //     src: '/projects/regul-1.jpg',
    //     alt: 'Номер отеля',
    //   },
    //   {
    //     src: '/projects/regul-2.jpg',
    //     alt: 'Номер отеля',
    //   },
    //   {
    //     src: '/projects/regul-3.jpg',
    //     alt: 'Номер отеля',
    //   },
    //   {
    //     src: '/projects/regul-4.jpg',
    //     alt: 'Номер отеля',
    //   },
    //   {
    //     src: '/projects/regul-5.jpg',
    //     alt: 'Номер отеля',
    //   },
    //   {
    //     src: '/projects/regul-6.jpg',
    //     alt: 'Номер отеля',
    //   },
    // ],
  },
  {
    slug: 'parradosso',
    img: '/clients/parradosso_main.jpg',
    logo: project3Logo,
    projectName: 'Паррадоссо',
    projectType: 'Авторский отель',
    stars: 5,
    title: 'Представляем вам Авторский отель Паррадоссо',
    subTitle: 'Пятизвездочный авторский отель в самом центре стоилцы',
    text: [
      'Авторский отель Паррадоссо — это сочетание современных технологических решений с историческими элементами здания. Отель находится в самом центре столицы в шаговой доступности от главных достопримечательностей столицы.',
      'Отелю присвоено 5 звезд. Мы подошли с душой к оформлению каждого номера и сделали их максимально комфортными и уютными для Вас. Все номера оборудованы кондиционером, сейфом, спутниковым телевидением, телефоном, столом и креслами.',
      // 'Здание, носящее официальное наименование “Комплекс доходных домов, начало XX века, архитектора Розенкампфа К.Л. (в основе – городская усадьба 2-й половины XVIII — XIX вв.). – Доходный дом, середина XIX века. Затем здание неоднократно перестраивали, но симметричная первоначальная композиция главного и торцевого фасадов, а также штукатурный декор сохранили свой исторический облик.',
      // 'На протяжении 2018-2020 гг. прошла полная реставрация здания, которое сохранило исторический облик и вписалась в современную городскую инфраструктуру.',
      // 'Индивидуальный подход к каждому гостю – это то, что мы ежедневно используем, каждый гость уникален для нас! Мы приложили максимум усилий, чтобы гости нашего отеля проживали в столице комфортно!',
    ],
    // images: [
    //   {
    //     src: '/projects/parr-1.jpg',
    //     alt: 'Номер отеля',
    //   },
    //   {
    //     src: '/projects/parr-2.jpg',
    //     alt: 'Номер отеля',
    //   },
    //   {
    //     src: '/projects/parr-3.jpg',
    //     alt: 'Номер отеля',
    //   },
    //   {
    //     src: '/projects/parr-4.jpg',
    //     alt: 'Номер отеля',
    //   },
    //   {
    //     src: '/projects/parr-5.jpg',
    //     alt: 'Номер отеля',
    //   },
    //   {
    //     src: '/projects/parr-6.jpg',
    //     alt: 'Номер отеля',
    //   },
    //   {
    //     src: '/projects/parr-7.jpg',
    //     alt: 'Какой то текст (например название помещения)',
    //   },
    // ],
  },
  {
    slug: 'tchaikovsky',
    img: '/clients/tchaika_main.jpg',
    logo: project4Logo,
    projectName: 'Чайковский',
    projectType: 'Бутик-отель',
    stars: 4,
    title: 'Бутик-отель Чайковский',
    subTitle: 'Представляем 4* бутик-отель в центре Москвы.',
    text: [
      '«Чайковский» — это не только всемирно известный композитор и музыкант, теперь его имя носит новый отель, расположенный в самом сердце нашей прекрасной столицы.',
      'Отель «Чайковский» — это уникальное сочетание изящных интерьеров и современного экологического дизайна, идеальное расположение в непосредственной близости от всемирно известных достопримечательностей Москвы. Чайковский является одним из величайших композиторов мира, одним из выдающихся лириков и драматургов-психологов в музыке и ярким представителем музыкального романтизма, который прослеживается в стиле и дизайне отеля.',
      // 'Вся территория отеля оснащена бесплатным Wi-Fi — мы гарантируем хорошее интернет-соединение в номерах. В нашем отеле три типа номеров — стандартный, улучшенный и люкс, в которых есть всё необходимое для комфортного проживания. Мы подошли с душой к оформлению каждого номера и сделали их максимально комфортными и уютными для Вас.',
      // 'Все номера оборудованы кондиционером, сейфом, спутниковым телевидением, телефоном, столом и креслами. В каждом номере имеются собственные ванные комнаты. В наличии полотенца, халаты, тапочки, банные принадлежности и фен. Уборка номеров производится ежедневно, смена постельного белья – каждые три дня.',
    ],
    // images: [
    //   {
    //     src: '/projects/tch-1.jpg',
    //     alt: 'Номер отеля',
    //   },
    //   {
    //     src: '/projects/tch-2.jpg',
    //     alt: 'Номер отеля',
    //   },
    //   {
    //     src: '/projects/tch-3.jpg',
    //     alt: 'Номер отеля',
    //   },
    //   {
    //     src: '/projects/tch-4.jpg',
    //     alt: 'Номер отеля',
    //   },
    //   {
    //     src: '/projects/tch-5.jpg',
    //     alt: 'Номер отеля',
    //   },
    //   {
    //     src: '/projects/tch-6.jpg',
    //     alt: 'Номер отеля',
    //   },
    //   {
    //     src: '/projects/tch-7.jpg',
    //     alt: 'Номер отеля',
    //   },
    // ],
  },
]

const projects = (req, res) => {
  const { slug } = req.query
  if (!slug) {
    return res.status(200).json({ projectCards })
  }

  try {
    const data = projectCards.find((el) => el.slug === slug)
    if (!data) {
      throw new Error('Не найдено')
    }
    res.status(200).json({ data })
  } catch (error) {
    res.status(404).json({ error })
  }
}

export default projects
