import project1Logo from '@/assets/img/logo-myaso.svg'
import project2Logo from '@/assets/img/logo-regul.svg'
import project3Logo from '@/assets/img/logo-parradosso.svg'
import project4Logo from '@/assets/img/logo-tchaika.svg'

const projectCards = [
  {
    slug: 'myasnitskiy',
    img: '/clients/myaso_main.jpg',
    logo: project1Logo,
    projectName: 'Мясницкий',
    projectType: 'Бутик-отель',
    stars: 4,
    title: 'Представляем вам Мясницкий Бутик-отель',
    subTitle: 'Новый мини-отель на самой аристократической улице столицы',
    text: [
      'Бутик-отель "Мясницкий" находится в историческом здании, которое является памятником архитектуры середины XVIII века. Ранее в этом помещении находились офисы и банк, но они были заброшены, и здание потеряло свой прежний блеск.',
      'В 2018 году наша компания произвела реконструкцию и новый отель открыл свои двери для гостей.',
      'Местоположение отеля в самом центре столицы и его историческая ценность были решающими факторами при выборе места для отеля.',
      'Отель принимал гостей во время чемпионата мира по футболу в 2018 году и успешно пережил пандемию COVID-19, продолжая свою работу и на сегодняшний день.',
      'Для обеспечения стабильного успеха в сфере гостиничного бизнеса необходимо провести грамотное проектирование на ранних этапах, правильно выбрать целевой сегмент рынка, иметь ясное представление о потребностях будущих гостей и готовность оперативно реагировать на изменения на рынке.',
    ],
  },
  {
    slug: 'regul',
    img: '/clients/regul_main.jpg',
    logo: project2Logo,
    projectName: 'Regul',
    projectType: 'Бутик-отель',
    stars: 5,
    title: 'Представляем вам REGUL Boutique-Hotel',
    subTitle: 'Пятизвездочный бутик-отель в самом центре столицы',
    text: [
      'Бутик-отель "Регул" расположен всего в нескольких шагах от главной улицы Москвы - Тверской.',
      'Это прекрасное место, которое ранее было заброшенным зданием, требующим серьезной реконструкции.',
      'В 2018 году оно претерпело большие изменения и превратилось в элегантный и современный бутик-отель, который с радостью приветствует гостей столицы.',
      'Бутик-Отель "Регул"  - отель с небольшим номерным фондом и собственным ресторан.',
      'Отель стал уютным и комфортным местом проживания для гостей столицы и процветающим бизнесом для владельцев.',
      'В теплое время года здесь работает летняя веранда, зеленый островок в центре Москвы, где гости и жители города могут отдохнуть от городской суеты.',
      'Превосходное расположение, высочайший уровень обслуживания и изысканная кухня - все это обеспечивает постоянный поток гостей в наш отель.',
    ],
  },
  {
    slug: 'parradosso',
    img: '/clients/parradosso_main.jpg',
    logo: project3Logo,
    projectName: 'Паррадоссо',
    projectType: 'Авторский отель',
    stars: 5,
    title: 'Представляем вам Авторский отель Паррадоссо',
    subTitle: 'Пятизвездочный авторский отель в самом центре столицы',
    text: [
      'Здание отеля Паррадоссо представляет собой ценный объект культурного наследия, построенный в середине 19 века.',
      'Это прекрасный образец пост-классицистического стиля и официально называется "Комплекс доходных домов, начало ХХ века, архитектора Розенкампфа Клавдия Леонидовича". За время своего существования здание было неоднократно перестроено, однако его первоначальная симметричная композиция главного и торцевого фасадов, а также характерный для середины ХХ века штукатурный декор, сохранили свой исторический облик. Особенно привлекательным элементом здания является его парадная лестница, которая была сохранена в первозданном виде.',
      'За период с 2018 по 2020 годы мы полностью восстановили здание, сохраняя его историческую атмосферу, при этом успешно интегрировав элементы современного дизайна.',
      'Мы вложили огромное количество работы и усилий как в дизайнерскую концепцию, так и в строительство, и теперь наш Отель представляет собой идеальное сочетание истории и современности, что находит отклик у наших гостей.',
    ],
  },
  {
    slug: 'tchaikovsky',
    img: '/clients/tchaika_main.jpg',
    logo: project4Logo,
    projectName: 'Чайковский',
    projectType: 'Бутик-отель',
    stars: 4,
    title: 'Бутик-отель Чайковский',
    subTitle: 'Представляем четырехзвездочный бутик-отель в центре Москвы.',
    text: [
      'Отель Чайковский расположен в историческом здании на Большой Никитской 24/1 стр.6, известном как Доходный дом княгини Голицыной.',
      'Ранее здесь находились обычные офисы, сдаваемые в аренду. Однако благодаря привлекательной локации рядом с Красной площадью, увеличению числа туристов в Москве, а также с учетом приближающегося Чемпионата мира по футболу, было принято решение переделать эти офисы в отель.',
      'Особый интерес к зданию вызывает его история: в 1877 году здесь находился один из первых крупных доходных домов Москвы, принадлежавший П.Н. Батюшкову. Здесь также снимал квартиру великий композитор Петр Чайковский, что отразилось и в названии отеля, и в его дизайне.',
      'Мы приложили все усилия, чтобы сохранить исторические детали и энергетику прошлого, предоставляя нашим гостям уникальную возможность погрузиться в историю.',
      'Несмотря на небольшую площадь, мы смогли разместить оптимальное количество номеров, обеспечивая эффективное функционирование нашего бизнеса. А благодаря дизайну, удачному расположению, атмосфере и высокому уровню сервиса, наш отель стал идеальным местом для пребывания гостей в столице.',
    ],
  },
]

const projects = (req, res) => {
  const { slug } = req.query
  if (!slug) {
    return res.status(200).json({ projectCards })
  }

  try {
    const data = projectCards.find((el) => el.slug === slug)
    if (!data) {
      throw new Error('Не найдено')
    }
    res.status(200).json({ data })
  } catch (error) {
    res.status(404).json({ error })
  }
}

export default projects
